particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHAN'TABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "exflash_hal.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <inttypes.h>
#include "nrfx_qspi.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "app_util_platform.h"
#include "app_error.h"
#include "hw_config.h"
#include "logging.h"
#include "flash_common.h"
#include "nrf_nvic.h"
#include "concurrent_hal.h"
#include "gpio_hal.h"
#include "system_error.h"
#include "nrf_system_error.h"
#include "check.h"

#define PRTCL_QSPI_DEFAULT_CINSTR(opc, len) \
{                                           \
    .opcode    = (opc),                     \
    .length    = (len),                     \
    .io2_level = true,                      \
    .io3_level = true,                      \
    .wipwait   = true,                      \
    .wren      = true                       \
}

enum qspi_cmds_t {
    QSPI_STD_CMD_WRSR            = 0x01, // Write Status Register
    QSPI_STD_CMD_WREN            = 0x06, // Write Enable: Sets WEL bit before every write operation
    QSPI_STD_CMD_RSTEN           = 0x66, // Enable Reset
    QSPI_STD_CMD_RST             = 0x99, // Reset
    QSPI_STD_CMD_SLEEP           = 0xB9, // GD25: "Power Down", MX25: "Deep Power Down"
    QSPI_STD_CMD_READ_ID         = 0x9F, // Read Identification

    QSPI_MX25_CMD_ENSO           = 0xB1, // Enter Secured OTP
    QSPI_MX25_CMD_EXSO           = 0xC1, // Exit Secured OTP
    QSPI_MX25_CMD_RDSCUR         = 0x2B, // Read Security Register
    QSPI_MX25_CMD_WRSCUR         = 0x2F, // Write Security Register (ie lock OTP)
    QSPI_MX25_CMD_PGMERS_SUSPEND = 0xB0, // Program/Erase Suspend

    QSPI_GD25_CMD_WRSR2          = 0x31, // Write Status Register 2
    QSPI_GD25_CMD_WRSR3          = 0x11, // Write Status Register 3
    QSPI_GD25_CMD_SEC_ERASE      = 0x44, // Security Register Erase (ie Erase OTP)
    QSPI_GD25_CMD_SEC_READ       = 0x48, // Security Register Read
    QSPI_GD25_CMD_SEC_PROGRAM    = 0x42, // Security Register Program (ie Write OTP)
    QSPI_GD25_CMD_PGMERS_SUSPEND = 0x75, // Program/Erase Suspend
};

enum qspi_type_t {
    QSPI_TYPE_MX25L3233F,
    QSPI_TYPE_MX25R6435FZNIL0,
    QSPI_TYPE_GD25WQ64EQFG,
    QSPI_TYPE_END
};

// For any variations between flash parts, set member vars at runtime
typedef struct  {
    int type;                        // qspi_type_t to identify what part is present
    bool part_detected;              // Have we positively identified the flash part yet
    nrf_qspi_writeoc_t write_opcode; // Which opcode to use for quad write
    uint8_t pgmers_suspend_opcode;   // Which opcode to use when interrupting pending program/erase command
    uint8_t sck_delay;               // tSHSL, tWHSL, and tSHWL in number of 16 MHz periods (62.5ns)
    uint32_t otp_size;               // Size of OTP area in bytes
    int (*init)();                   // Function to call once chip is identified. IE enter QSPI mode
                                     // TODO: GD25: CLK and CSN pin drive strength? 
} exflash_driver_parameters_t;

static exflash_driver_parameters_t hal_exflash_driver = {};

static hal_exflash_state_t qspi_state = HAL_EXFLASH_STATE_DISABLED;

static const size_t MX25R6435F_OTP_SECTOR_SIZE = 1024;
static const size_t MX25L3233F_OTP_SECTOR_SIZE = 512;

static const size_t GD25_SECURITY_REGISTER_COUNT = 3;
static const size_t GD25_SECURITY_REGISTER_SIZE = 1024;
static const size_t GD25_OTP_SECTOR_SIZE = GD25_SECURITY_REGISTER_SIZE * GD25_SECURITY_REGISTER_COUNT;

static const uint32_t MX25_MANUFACTURER_ID = 0xC2;
static const uint32_t MX25R6435F_MEMORY_TYPE = 0x28;
static const uint32_t MX25L3233F_MEMORY_TYPE = 0x20;

static const uint32_t GD25_MANUFACTURER_ID = 0xC8;

static nrf_qspi_cinstr_len_t getNrfCinstrLength(size_t length) {
    nrf_qspi_cinstr_len_t cinstrLen = NRF_QSPI_CINSTR_LEN_1B;
    switch (length) {
        case 1: cinstrLen = NRF_QSPI_CINSTR_LEN_1B; break;
        case 2: cinstrLen = NRF_QSPI_CINSTR_LEN_2B; break;
        case 3: cinstrLen = NRF_QSPI_CINSTR_LEN_3B; break;
        case 4: cinstrLen = NRF_QSPI_CINSTR_LEN_4B; break;
        case 5: cinstrLen = NRF_QSPI_CINSTR_LEN_5B; break;
        case 6: cinstrLen = NRF_QSPI_CINSTR_LEN_6B; break;
        case 7: cinstrLen = NRF_QSPI_CINSTR_LEN_7B; break;
        case 8: cinstrLen = NRF_QSPI_CINSTR_LEN_8B; break;
        case 9: cinstrLen = NRF_QSPI_CINSTR_LEN_9B; break;
        default: break;
    }
    return cinstrLen;
}

// Mitigations for nRF52840 anomaly 215
// [215] QSPI: Reading QSPI registers after XIP might halt CPU
// Conditions
// Init and start QSPI, use XIP, then write to or read any QSPI register with an offset above 0x600.
//
// Consequences
// CPU halts.
//
// Workaround
// Trigger QSPI TASKS_ACTIVATE after XIP is used before accessing any QSPI register with an offset above 0x600.
//
// Our testing showed that another side effect of this anomaly is not a lockup
// but a failure to perform any Custom Instructions that rely on CISTR* registers
// of QSPI peripheral, which are located above offset 0x600.
//
// The mitigation that we are implementing is rather simple. We need to ensure that no XIP
// access occurs while we are performing Custom Instructions and we need to apply the workaround mentioned
// in the anomaly description (QSPI TASKS_ACTIVATE).
// There is a performance penalty because we are disabling RTOS thread scheduling,
// however because we are only doing this for CINSTR, it should be minimal.

