particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
    return 0;
}

int gd25_secure_register_write(uint8_t security_registers_index, uint32_t security_registers_addr, const void* buf, size_t size) {
    CHECK_TRUE(security_registers_index < GD25_SECURITY_REGISTER_COUNT, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(security_registers_addr + size <= GD25_SECURITY_REGISTER_SIZE, SYSTEM_ERROR_INVALID_ARGUMENT);

    nrf_qspi_cinstr_conf_t writeSecurityRegister = PRTCL_QSPI_DEFAULT_CINSTR(QSPI_GD25_CMD_SEC_PROGRAM, NRF_QSPI_CINSTR_LEN_1B);

    uint32_t address = 0;
    uint8_t addrBuf[3] = {};
    address = ((security_registers_index + 1) << 12) + security_registers_addr;
    addrBuf[0] = (uint8_t)((address>>16) & 0xFF);
    addrBuf[1] = (uint8_t)((address>>8) & 0xFF);
    addrBuf[2] = (uint8_t)((address>>0) & 0xFF);

    nrfx_err_t ret = nrfx_qspi_lfm_start(&writeSecurityRegister);
    CHECK_TRUE(ret == NRFX_SUCCESS, nrf_system_error(ret));
    nrf_delay_us(10); // FIXME: need a bit delay before transmitting data
    ret = nrfx_qspi_lfm_xfer(addrBuf, NULL, sizeof(addrBuf), false); // Send address bytes, do not finalize long frame transfer
    CHECK_TRUE(ret == NRFX_SUCCESS, nrf_system_error(ret));
    ret = nrfx_qspi_lfm_xfer(buf, NULL, size, true); // Send data to write, finalize long frame transfer
    CHECK_TRUE(ret == NRFX_SUCCESS, nrf_system_error(ret));

    return 0;
}

static void exflash_set_driver_parameters(uint32_t flash_type) {
    switch (flash_type) {
        case QSPI_TYPE_MX25L3233F: // fall through
        case QSPI_TYPE_MX25R6435FZNIL0:
            hal_exflash_driver.type = flash_type;
            hal_exflash_driver.write_opcode = (nrf_qspi_writeoc_t)NRFX_QSPI_CONFIG_WRITEOC; // 0x38: PP4IO
            hal_exflash_driver.pgmers_suspend_opcode = QSPI_MX25_CMD_PGMERS_SUSPEND;
            hal_exflash_driver.sck_delay = (uint8_t)NRFX_QSPI_CONFIG_SCK_DELAY;
            hal_exflash_driver.otp_size = (flash_type == QSPI_TYPE_MX25R6435FZNIL0) ? MX25R6435F_OTP_SECTOR_SIZE : MX25L3233F_OTP_SECTOR_SIZE;
            hal_exflash_driver.init = (flash_type == QSPI_TYPE_MX25R6435FZNIL0) ? &exflash_init_MX25R6435FZNIL0 : &exflash_init_MX25L3233F;
            break;
        case QSPI_TYPE_GD25WQ64EQFG:
            hal_exflash_driver.type = QSPI_TYPE_GD25WQ64EQFG;
            hal_exflash_driver.write_opcode = NRF_QSPI_WRITEOC_PP4O; // 0x32: PP40
            hal_exflash_driver.pgmers_suspend_opcode = QSPI_GD25_CMD_PGMERS_SUSPEND;
            hal_exflash_driver.sck_delay = 2;
            hal_exflash_driver.otp_size = GD25_OTP_SECTOR_SIZE;
            hal_exflash_driver.init = &exflash_init_GD25;
            break;
        case QSPI_TYPE_END: // fall through
        default:
            break;
    }
}

//__attribute__(( optimize("-O0") ))
int hal_exflash_init(void) {
    int ret = 0;

    // PATCH: Initialize CS pin, external memory discharge
    nrf_gpio_cfg_output(QSPI_FLASH_CSN_PIN);
    nrf_gpio_pin_set(QSPI_FLASH_CSN_PIN);
    nrf_gpio_cfg_input(QSPI_FLASH_IO1_PIN, NRF_GPIO_PIN_PULLDOWN);

    hal_exflash_lock();

    for (uint32_t i = 0; i < QSPI_TYPE_END && !hal_exflash_driver.part_detected; i++) {
        exflash_set_driver_parameters(i);

        nrfx_qspi_config_t config = {
            .xip_offset  = NRFX_QSPI_CONFIG_XIP_OFFSET,
            .pins = {
               .sck_pin     = QSPI_FLASH_SCK_PIN,
               .csn_pin     = QSPI_FLASH_CSN_PIN,
               .io0_pin     = QSPI_FLASH_IO0_PIN,
               .io1_pin     = QSPI_FLASH_IO1_PIN,
               .io2_pin     = QSPI_FLASH_IO2_PIN,
               .io3_pin     = QSPI_FLASH_IO3_PIN,
            },
            .prot_if = {
                .readoc     = (nrf_qspi_readoc_t)NRFX_QSPI_CONFIG_READOC,
                .writeoc    = hal_exflash_driver.write_opcode,
                .addrmode   = (nrf_qspi_addrmode_t)NRFX_QSPI_CONFIG_ADDRMODE,
                .dpmconfig  = false,
            },
            .phy_if = {
                .sck_delay  = hal_exflash_driver.sck_delay,
                .dpmen      = false,
                .spi_mode   = (nrf_qspi_spi_mode_t)NRFX_QSPI_CONFIG_MODE,
                .sck_freq   = (nrf_qspi_frequency_t)NRFX_QSPI_CONFIG_FREQUENCY
            },
            .irq_priority   = (uint8_t)QSPI_FLASH_IRQ_PRIORITY
        };

        ret = nrfx_qspi_init(&config, NULL, NULL);
        if (ret) {
            if (ret == NRFX_ERROR_TIMEOUT) {
                // Could have timed out because the flash chip might be in an ongoing program/erase operation.
                // Suspend it.
                LOG_DEBUG(TRACE, "QSPI NRFX timeout error. Suspend pgm/ers op.");
                ret = hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SUSPEND_PGMERS, NULL, NULL, 0);
                if (ret) {
                    ret = nrf_system_error(ret);
                    break;
                }
            }
        }
        LOG_DEBUG(TRACE, "QSPI initialized.");
        qspi_state = HAL_EXFLASH_STATE_ENABLED;

        // Determine chip type / wake up from potential sleep
        uint8_t chip_id[3] = {};
        ret = hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_READID, NULL, chip_id, 0);

        if (ret) {
            ret = nrf_system_error(ret);
            break;
        }
        else {
            LOG_DEBUG(TRACE, "exflash chip id: %02X %02X %02X", chip_id[0], chip_id[1], chip_id[2]);
        }

        if ((hal_exflash_driver.type == QSPI_TYPE_MX25R6435FZNIL0 || hal_exflash_driver.type == QSPI_TYPE_MX25L3233F) && 
            chip_id[0] == MX25_MANUFACTURER_ID) {
            if (chip_id[1] == MX25R6435F_MEMORY_TYPE) {
                exflash_set_driver_parameters(QSPI_TYPE_MX25R6435FZNIL0);
            } else if (chip_id[1] == MX25L3233F_MEMORY_TYPE) {
                exflash_set_driver_parameters(QSPI_TYPE_MX25L3233F);
            } else {
                // Unrecognized MXIC part, return error
                ret = SYSTEM_ERROR_NOT_SUPPORTED;
                break;
            }
            hal_exflash_driver.part_detected = true;
        } else if ((hal_exflash_driver.type == QSPI_TYPE_GD25WQ64EQFG) && (chip_id[0] == GD25_MANUFACTURER_ID)) {
            exflash_set_driver_parameters(QSPI_TYPE_GD25WQ64EQFG);
            hal_exflash_driver.part_detected = true;
        }

        if (hal_exflash_driver.part_detected) {
            // Reset chip, put it into QSPI mode
            ret = hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_RESET, NULL, NULL, 0);
            if (ret) {
                ret = nrf_system_error(ret);
            }
            break;
        } else {
            nrfx_qspi_uninit();
            continue;
        }
    }

    hal_exflash_unlock();
    return ret;
}

