particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
        while (data_to_read && !ret) {
            // Determine the offset of the current OTP register to start writing at
            size_t register_offset = (addr + data_read) % GD25_SECURITY_REGISTER_SIZE;
            read_amount = data_to_read;

            // If the data remaining to read extends into the next register, truncate the read amount to fit into this register
            if (register_offset + read_amount > GD25_SECURITY_REGISTER_SIZE){
                read_amount = GD25_SECURITY_REGISTER_SIZE - register_offset;
            }

            ret = gd25_secure_register_read(otp_page, register_offset, &data_buf[data_read], read_amount);

            // Increment/decrement counter variables, increment to the next OTP register
            data_to_read -= read_amount;
            data_read += read_amount;
            otp_page++;
        }
    } else {
        ret = enter_secure_otp();
        if (!ret) {
            ret = hal_exflash_read(addr, data_buf, data_size);
        }
        exit_secure_otp(); 
    }

    hal_exflash_unlock();
    return ret;
}

int hal_exflash_write_special(hal_exflash_special_sector_t sp, uintptr_t addr, const uint8_t* data_buf, size_t data_size) {
    CHECK_TRUE(sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(addr + data_size <= hal_exflash_driver.otp_size, SYSTEM_ERROR_OUT_OF_RANGE);
    CHECK_TRUE(data_buf != NULL, SYSTEM_ERROR_INVALID_ARGUMENT);
    int ret = 0;

    hal_exflash_lock();

    if (hal_exflash_driver.type == QSPI_TYPE_GD25WQ64EQFG) {
        // Determine which OTP Register to start writing to
        size_t otp_page = addr / GD25_OTP_SECTOR_SIZE;
        size_t data_to_write = data_size;
        size_t data_written = 0;
        size_t write_amount = 0;

        while (data_to_write && !ret) {
            // Determine the offset of the current OTP register to start writing at
            size_t register_offset = (addr + data_written) % GD25_SECURITY_REGISTER_SIZE;
            write_amount = data_to_write;

            // If the data remaining to write extends into the next register, truncate the write amount to fit into this register
            if (register_offset + write_amount > GD25_SECURITY_REGISTER_SIZE){
                write_amount = GD25_SECURITY_REGISTER_SIZE - register_offset;
            }

            ret = gd25_secure_register_write(otp_page, register_offset, &data_buf[data_written], write_amount);

            // Increment/decrement counter variables, increment to the next OTP register
            data_to_write -= write_amount;
            data_written += write_amount;
            otp_page++;
        }
    } else {
        ret = enter_secure_otp();
        if (!ret) {
            ret = hal_exflash_write(addr, data_buf, data_size);
        }
        exit_secure_otp();
    }

    hal_exflash_unlock();
    return ret;
}

int hal_exflash_erase_special(hal_exflash_special_sector_t sp, uintptr_t addr, size_t size) {
    /* We only support OTP sector and since it's One Time Programmable, we can't erase it */
    // TODO: GD25 *can* support OTP erasing, do we want to implement it? 
    return -1;
}

int hal_exflash_special_command(hal_exflash_special_sector_t sp, hal_exflash_command_t cmd, const uint8_t* data, uint8_t* result, size_t size) {
    int ret = -1;

    hal_exflash_lock();
    /* General commands */
    if (sp == HAL_EXFLASH_SPECIAL_SECTOR_NONE) {
        nrf_qspi_cinstr_conf_t cinstr_cfg = {
            .opcode    = 0x00,
            .length    = NRF_QSPI_CINSTR_LEN_1B,
            .io2_level = true,
            .io3_level = true,
            .wipwait   = true,
            .wren      = true
        };

        if (cmd == HAL_EXFLASH_COMMAND_SLEEP) {
            cinstr_cfg.opcode = QSPI_STD_CMD_SLEEP;
        } else if (cmd == HAL_EXFLASH_COMMAND_WAKEUP || cmd == HAL_EXFLASH_COMMAND_READID) {
            /* Wake up external flash from deep power down mode by sending read id command */
            cinstr_cfg.opcode = QSPI_STD_CMD_READ_ID;
            cinstr_cfg.length = NRF_QSPI_CINSTR_LEN_4B;
        } else if (cmd == HAL_EXFLASH_COMMAND_SUSPEND_PGMERS) {
            /* suspend an ongoing program or erase operation */
            cinstr_cfg.opcode = hal_exflash_driver.pgmers_suspend_opcode;
        } else if (cmd == HAL_EXFLASH_COMMAND_RESET) {
            cinstr_cfg.opcode = QSPI_STD_CMD_RSTEN;
        } else {
            goto exit;
        }

        // Execute the command.
        ret = exflash_qspi_cinstr_xfer(&cinstr_cfg, NULL, result);

        // For the reset procedure, we need to execute the reset command going forward.
        if (!ret && cmd == HAL_EXFLASH_COMMAND_RESET) {
            cinstr_cfg.opcode = QSPI_STD_CMD_RST;
            ret = exflash_qspi_cinstr_xfer(&cinstr_cfg, NULL, NULL);
            if (ret) {
                goto exit;
            }

            if (hal_exflash_driver.init) {
                // TODO: Consolidate init here?
                ret = hal_exflash_driver.init();
            }
        }
    } else if (sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP) {
        /* OTP-specific commands */
        if (cmd == HAL_EXFLASH_COMMAND_LOCK_ENTIRE_OTP) {
            /* Secured OTP Indicator bit (4K-bit Secured OTP)
             * 1 = factory lock
             * This will block the whole OTP region.
             */
            uint8_t v = 0x01;
            ret = exflash_qspi_cinstr_quick_send(QSPI_MX25_CMD_WRSCUR, getNrfCinstrLength(2), &v);
            // TODO: Lock OTP for GD25?
        }
    }

exit:
    hal_exflash_unlock();
    return ret;
}

int hal_exflash_sleep(bool sleep, void* reserved) {
    hal_exflash_lock();
    if (sleep) {
        // Suspend external flash
        if (qspi_state != HAL_EXFLASH_STATE_ENABLED) {
            hal_exflash_unlock();
            return SYSTEM_ERROR_INVALID_STATE;
        }
        // Put external flash into Deep Power-down mode
        if (hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SLEEP, NULL, NULL, 0)) {
            // It may fail as the flash chip might be in an ongoing program/erase operation. Suspend it.
            hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SUSPEND_PGMERS, NULL, NULL, 0);
            // Abort the suspended write/erase operation.
            hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_RESET, NULL, NULL, 0);
            // Try enter Deep Power-down mode again
            int ret = hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SLEEP, NULL, NULL, 0);
            if (ret) {
                // Give up entering Deep Power-down mode.
                hal_exflash_unlock();
                return ret;
            }
        }
        // Disable QSPI peripheral
        hal_exflash_uninit();
        qspi_state = HAL_EXFLASH_STATE_SUSPENDED;
    } else {
        // Restore external flash
        if (qspi_state != HAL_EXFLASH_STATE_SUSPENDED) {
            hal_exflash_unlock();
            return SYSTEM_ERROR_INVALID_STATE;
        }
        int ret = hal_exflash_init();
        if (ret != SYSTEM_ERROR_NONE) {
            hal_exflash_unlock();
            return ret;
        }
    }
    hal_exflash_unlock();
    return SYSTEM_ERROR_NONE;
}

int hal_exflash_otp_size(void) {
    return hal_exflash_driver.part_detected ? (int)hal_exflash_driver.otp_size : SYSTEM_ERROR_UNKNOWN;
}
